2.SOAP-API/4.InsertNewStudentRecordsWithMruTrue.txt

<?xml version="1.0" encoding="utf-8"?>   
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:urn="urn:enterprise.soap.sforce.com"
  xmlns:urn1="urn:sobject.enterprise.soap.sforce.com"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Header>
     <urn:SessionHeader>
        <urn:sessionId>00D5g00000GYf6f!ARwAQHfhJRaZDJQF8kfQ6cRRUH7zjYpzTbc3GHWblbSXJnR5zQ49mhww4CZA398VSvVF1SLA7aEWqNKgS4VHOoYzcKphyC22</urn:sessionId>
     </urn:SessionHeader>
     <urn:MruHeader>
         <urn:updateMru>true</urn:updateMru>
     </urn:MruHeader>
  </soapenv:Header>
  <soapenv:Body>
    <urn:create>
        <urn:sObjects xsi:type="urn1:Student__c">
            <Student_Name__c> Sim Aulakh </Student_Name__c>
            <Phone_Number__c> 4567890000 </Phone_Number__c>
            <Address__c> Mckinney,Texas </Address__c>
            <School__c>a0B5g00000tpuTiEAI</School__c>
            <Class_Enrolled__c>7</Class_Enrolled__c>
        </urn:sObjects>
    </urn:create>
  </soapenv:Body>
</soapenv:Envelope>
