ui-test/mock/demos/salesforce.com/wsdl/create_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:enterprise.soap.sforce.com" xmlns:urn1="urn:sobject.enterprise.soap.sforce.com"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <urn:SessionHeader>
         <urn:sessionId>00Db0000000bl2D!ARgAQBSK4KwZrf3NzNYjK97BnXswzpeqsKHKbyj12tkn4eIAMpVeNMxk.dCyvpOI8mUVyVJnPcfClypSv6Dmd1VtjYYbNPGV</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:create>
         <!--Zero or more repetitions:-->
         		<urn:sObjects xsi:type="urn1:Account">
            	<!--Zero or more repetitions:-->
				<urn1:Name>My Account</urn1:Name>
           	</urn:sObjects>
      </urn:create>
   </soapenv:Body>
</soapenv:Envelope>